## Merge Pandas DataFrames

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">1. Import Library</font><br>
</div>

In [2]:
import pandas as pd

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">2. Create Data Frames</font><br>
</div>

In [3]:
#Student Data 
student_data = {
    "Student_Id": [101, 102, 103, 104, 105],
    "Name": ["Ben", "Danielle", "Sam", "Will", "Melissa"],
    "Gender": ["male", "female", "male", "male", "female"],
    "Phone_Num": [5924, 1933, 3481, 2752, 9873]
}

#Books in KU library 
book_data = {
    "Book_Id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Title": ["The Old Man and the Sea", "The Little Prince", "My Sweet Orange Tree", "Harry Potter", "Moby-Dick", "The Catcher in the Rye", "Big Fish", "Norwegian Wood", "Pride and Prejudice", "The Girl Who Leapt Through Time"],
    "Author": ["Ernest Hemingway", "Antoine de Saint-Exup√©ry", "Rio de Janeiro", "J. K. Rowling", "Herman Melville", "David Salinger", "Daniel Wallace", "Haruki Murakami", "Jane Austen", "Yasutaka Tsutsui"]
}

#Create Dataframes
student_df = pd.DataFrame(student_data)
book_df = pd.DataFrame(book_data)

In [28]:
#Will moved to other Univ.
#Index num 3
student_df = student_df.drop(3)

In [21]:
#Check-out on April
checkout_april = {
    "Student_Id": [101, 104, 101, 102, 105],
    "Book_Id": [4, 2, 3, 9, 10],
    "Date": ["2022-04-01", "2022-04-03", "2022-04-11", "2022-04-21", "2022-04-28"]
}

#Check-out on May
checkout_may = {
    "Student_Id": [103, 104, 101, 102, 101, 103, 102],
    "Book_Id": [1, 4, 5, 8, 7, 5, 6],
    "Date": ["2022-05-02", "2022-05-03", "2022-05-09", "2022-05-11", "2022-05-13", "2022-05-22", "2022-05-25"]
}

#Create Dataframes
checkout_april_df = pd.DataFrame(checkout_april)
checkout_may_df = pd.DataFrame(checkout_may)

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">3. Merge DataFrame Objects</font><br>
</div>

In [30]:
student_df

   Student_Id      Name  Gender  Phone_Num
0         101       Ben    male       5924
1         102  Danielle  female       1933
2         103       Sam    male       3481
4         105   Melissa  female       9873

In [31]:
checkout_april_df

   Student_Id  Book_Id        Date
0         101        4  2022-04-01
1         104        2  2022-04-03
2         101        3  2022-04-11
3         102        9  2022-04-21
4         105       10  2022-04-28

### 3-1. Inner Join
- <b>How to create a table that shows both info about students and their check-out history on April? (i.e., only for those who have check-out history)</b>

>- merge(df1, df2, how='inner')
    - the merge() method by default performs an inner join (how='inner')
>- Use intersection of keys from both frames
>- The output will contain all the records that have a mutual id in both df1 and df2
><img src="https://i.stack.imgur.com/YvuOa.png" width="350"/>

In [32]:
pd.merge(student_df, checkout_april_df, on="Student_Id", how="inner")
#Sam and Will were deleted

   Student_Id      Name  Gender  Phone_Num  Book_Id        Date
0         101       Ben    male       5924        4  2022-04-01
1         101       Ben    male       5924        3  2022-04-11
2         102  Danielle  female       1933        9  2022-04-21
3         105   Melissa  female       9873       10  2022-04-28

>- How many times did Will borrow a book on April?

<b>NOTE.</b> Will borrowed a book and his info was deleted

### 3-2. Left Outer Join
- <b>How to create a table that shows info about both those who have and do not have check-out history on April?</b>

>- merge(df1, df2, on='column', how='left')
>- Use keys from the left frame only
><img src="https://i.stack.imgur.com/BECid.png" width="350"/>

In [36]:
pd.merge(student_df, checkout_april_df, on="Student_Id", how="left")
#Still shows info about Sam

   Student_Id      Name  Gender  Phone_Num  Book_Id        Date
0         101       Ben    male       5924      4.0  2022-04-01
1         101       Ben    male       5924      3.0  2022-04-11
2         102  Danielle  female       1933      9.0  2022-04-21
3         103       Sam    male       3481      NaN         NaN
4         105   Melissa  female       9873     10.0  2022-04-28

### 3-3. Right Outer Join
>- merge(df1, df2, on='column', how='right')
>- Use keys from the right frame only
><img src="https://i.stack.imgur.com/8w1US.png" width="350"/>

In [37]:
pd.merge(student_df, checkout_april_df, on="Student_Id", how="right")
#Book_Id=2 was borrowed by Will but the borrower info was deleted

   Student_Id      Name  Gender  Phone_Num  Book_Id        Date
0         101       Ben    male     5924.0        4  2022-04-01
1         104       NaN     NaN        NaN        2  2022-04-03
2         101       Ben    male     5924.0        3  2022-04-11
3         102  Danielle  female     1933.0        9  2022-04-21
4         105   Melissa  female     9873.0       10  2022-04-28

### 3-4. Full Outer Join
>- merge(df1, df2, on='column', how='outer')
>- Use union of keys from both frames
><img src="https://i.stack.imgur.com/euLoe.png" width="350"/>

In [39]:
pd.merge(student_df, checkout_april_df, on="Student_Id", how="outer")

   Student_Id      Name  Gender  Phone_Num  Book_Id        Date
0         101       Ben    male     5924.0      4.0  2022-04-01
1         101       Ben    male     5924.0      3.0  2022-04-11
2         102  Danielle  female     1933.0      9.0  2022-04-21
3         103       Sam    male     3481.0      NaN         NaN
4         105   Melissa  female     9873.0     10.0  2022-04-28
5         104       NaN     NaN        NaN      2.0  2022-04-03